app/views/static_pages/home.html.erb

<div class="container" style="margin-top: 50px">
  <h1>Hey, <%= User.find_by(id: session[:user_id]).name %></h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]