app/views/sessions/test.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%= User.find_by(id: session[:user_id]).name %>