app/controllers/houses_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @house = House.new
    @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "houses" ("realtor_id", "location", "square_footage", "year", "style", "price", "floors", "basement", "owner") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["realtor_id", 1], ["location", "there"], ["square_footage", "2200"], ["year", 1996], ["style", "Single Family House"], ["price", 110000], ["floors", 3], ["basement", "t"], ["owner", "amy"]]
---
  def create
    @user = User.find(session[:user_id])
    if @user.roles != 2 && !@user.company_id.nil?
      @house = House.new(house_params)
      @house.company_id = @user.company_id
      respond_to do |format|
        if @house.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @house = House.find(params[:id])
    @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "houses" SET "square_footage" = ? WHERE "houses"."id" = ?  [["square_footage", "2172"], ["id", 1]]
---
  def update
    @user = User.find(session[:user_id])
    @house = House.find(params[:id])
    if @user.roles != 2 && @user.id == @house.realtor_id

      respond_to do |format|
        if @house.update_attributes(house_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @house = House.find(params[:id])
    @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
DELETE FROM "houses" WHERE "houses"."id" = ?  [["id", 2]]
---
  def destroy
    @user = User.find(session[:user_id])
    @house = House.find(params[:id])
    if @user.roles != 2 && @user.company_id == @house.company_id
      @house.destroy