app/controllers/real_estate_companies_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
INSERT INTO "real_estate_companies" ("name", "website", "address", "size", "founded", "revenue", "synopsis", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find(session[:user_id])
    puts @user.roles
    if @user.roles != 2
      @real_estate_company = RealEstateCompany.new(real_estate_company_params)

      respond_to do |format|
        if @real_estate_company.save

SELECT  "real_estate_companies".* FROM "real_estate_companies" WHERE "real_estate_companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @real_estate_company = RealEstateCompany.find(params[:id])

SELECT  "real_estate_companies".* FROM "real_estate_companies" WHERE "real_estate_companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "real_estate_companies" SET "synopsis" = ?, "updated_at" = ? WHERE "real_estate_companies"."id" = ?  [["synopsis", "We sell trash cans and the land they're on goodly"], ["updated_at", "2018-10-11 04:05:47.250304"], ["id", 2]]
---
  def update
    @real_estate_company = RealEstateCompany.find(params[:id])

    respond_to do |format|
      if @real_estate_company.update_attributes(real_estate_company_params)

SELECT "real_estate_companies".* FROM "real_estate_companies"
---
  def index
    @real_estate_companies = RealEstateCompany.all

SELECT  "real_estate_companies".* FROM "real_estate_companies" WHERE "real_estate_companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @real_estate_company = RealEstateCompany.find(params[:id])