app/controllers/static_pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "real_estate_companies".* FROM "real_estate_companies" WHERE "real_estate_companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def home
    @user = User.find_by(id: session[:user_id])
    @real_estate_company = RealEstateCompany.find_by(id: @user.company_id)