app/controllers/users_controller.rb

  def index
    if User.find(session[:user_id]).roles == 0
      @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def show
    if params[:id].to_s == session[:user_id].to_s || User.find(session[:user_id]).roles == 0
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "roles", "phone_number", "preferred_contact_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    if params[:id].to_s == session[:user_id].to_s || User.find(session[:user_id]).roles == 0
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def choose
    @real_estate_companies = RealEstateCompany.all
    @user = User.find(session[:user_id])
---
SELECT "real_estate_companies".* FROM "real_estate_companies"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if params[:id].to_s == session[:user_id].to_s || User.find(session[:user_id]).roles == 0
      @user = User.find(params[:id])

      respond_to do |format|
        if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "roles" = ?, "preferred_contact_method" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "carlenea@wilkinson.io"], ["roles", 1.0], ["preferred_contact_method", "Text"], ["updated_at", "2018-10-16 16:55:09.121324"], ["id", 5]]

  def destroy
    @logged_in = User.find(session[:user_id])
    if @logged_in.id == params[:id] || @logged_in.roles == 0
      @user = User.find(params[:id])
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]